* TD52
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                           | td52
Descriptive Name                      | 
Area                                  | Paakitsoq / Swiss Camp
Data reference                        | Unknown PDF: See td1 and Lüthi (2015)
Data DOI                              | 
Science reference                     | 
Science DOI                           | 
Date                                  | 1991-05-25
Longitude [°E]                        | -49.3
Latitude [°N]                         | 69.566
Location source                       | Unknown PDF: See td1 and Lüthi (2015)
Depth of top measurement [m]          | 5.0
Depth of bottom measurement [m]       | 600.0
Ice thickness [m]                     | >600
Coverage [% of thickness]             | #VALUE!
Ice thickness source                  | Unknown PDF: See td1 and Lüthi (2015)
Measured from: Top, Bottom, Relative  | T
General_Note                          | 
Temperature_note                      | 
Thickness_note                        | 
Location_note                         | 
#+end_example

** Temperature

+ See td1 Shallow88II.pdf. Also shown in [[citet:luthi_2015][Lüthi (2015)]].

** Thickness

+ From PDF
 
** Location

+ From PDF. Same as td51. Unknown if same borehole.

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv
#+END_SRC

#+RESULTS: ingest_data
|   d |     t |
|   5 |  -9.4 |
|  10 |  -8.7 |
|  15 |  -8.6 |
|  35 |  -8.4 |
| 135 | -10.1 |
| 235 |   -12 |
| 350 | -16.7 |
| 450 | -18.6 |
| 550 | -19.6 |
| 590 | -20.4 |
| 595 | -20.3 |
| 600 | -19.9 |

